# _*_ coding: utf-8 _*_

# 数値と四則演算 Numeri, Integer, Float

# 数値リテラルの例
# 2.7182818284 自然対数の底
# 541 １００番目の素数

# n進数の例
# 145 １０進数
# 0b10010001 145の２進数
# 0221 145の８進数
# 0x91 145の１６進数

# 指数表現の例
# 1.9891e30 太陽の質量(kg)

puts 32 + 24.1
puts 3.2 - 30
puts 3.2 + -30
puts 6 * 6.0
puts 2.5 / 3
puts 9 % 2

e = 2.7182818284
print "e=", e, "\n"
print "eの２倍は", 2 * e, "です\n"

prime100 = 541
print "１００番目の素数は", prime100, "です。\n"

printf( "20 + 2 = %04d\n", 20 + 2)
printf( "20 + 2 = %4d\n", 20 + 2)
printf( "2 - 20 = %04d\n", 2 - 20)
printf( "2.5 / 3 = %05f\n", 2.5 / 3)
printf( "9 %% 2 = %d\n", 9 % 2)

# 式展開してみる
print "e= #{e}\n"
print "eの2倍は、#{2*e}です。\n"
print "100番目の素数は、#{prime100}です。\n"





